
# 当代DBMS 2020
# Author:QiushiSun
# Project 1 TreasureHunt:treasures.py

from pymongo import ASCENDING
from pymongo import MongoClient
from pymongo.errors import DuplicateKeyError
from pymongo.errors import BulkWriteError

# 把宝物数据和主代码分开来，方便维护宝物库

rarity_map = {1: '普通', 2: '稀有', 3: '精良', 4: '史诗', 5: '传说'}

weapon = ['杀猪刀', '轻佩剑', '鱼杆', '旧匕首', '圆木盾', '链球', '木槌', '铁杆', '旧拳套', '普通法杖',  # 普通装备
          '连枷', '大砍刀', '奥金利斧', '魔杖', '战斧', '连弩', '套马杆', '搏击拳套', '龙枪', '大战锤',  # 稀有装备
          '心灵之牙', '熔火犬牙', '惩戒长戟', '黑色卫士', '残忍利刃', '力反馈盾牌', '冥河圆盾', '碎裂黑曜石盾牌', '土灵护卫者', '火核狙击步枪',  # 精良装备
          '无尽黑暗之刃', '坚定力量之镰', '神圣其拉战斧', '末日之刃', '密林战斧', '闪击强弓', '矮人手持火炮', '黑色赦免者', '迈克斯纳之牙', '帝殒',  # 史诗装备
          '沙赫拉姆黑剑', '龙之召唤', '烈焰之怒', '恶魔之击', '邪恶权杖', '瑞文戴尔之剑', '和平制造者', '军团徽记龙盾', '高辐射烈焰反射器', '刺灵之矛',  # 史诗装备
          '堕落王子之剑', '天启', '诅咒之喉', '奥达奇战刃', '风行者的遗产', '艾露恩之镰', '灭战者', '大地守护者之鳞', '泰坦之击', '瓦拉加尔之剑', # 史诗装备
          '荒野诸神之矛', '诸天之拳', '白银之手', '真理守护者', '圣光之怒', '恐惧之刃', '吞噬者之牙', '艾萨拉的权杖', '毁灭之锤', '逆风收割者', # 史诗装备
          '黑暗之手', '血吼', '霜之哀伤', '灰烬使者', '堕落的灰烬使者', '萨拉迈尼之剑', '黑檀之寒', '烈焰之击', '弑君', '影之哀伤',  # 传说装备
          ]

#80件

weapon_level = [1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
                2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
                3, 3, 3, 3, 3, 3, 3, 3, 3, 3,
                4, 4, 4, 4, 4, 4, 4, 4, 4, 4,
                4, 4, 4, 4, 4, 4, 4, 4, 4, 4,
                4, 4, 4, 4, 4, 4, 4, 4, 4, 4,
                4, 4, 4, 4, 4, 4, 4, 4, 4, 4,
                5, 5, 5, 5, 5, 5, 5, 5, 5, 5]

weapon_value = [1, 1, 1, 1, 1, 1, 1, 1, 1, 2,
                3, 4, 3, 4, 3, 4, 5, 6, 5, 6,
                10, 11, 12, 13, 15, 14, 15, 12, 13, 12,
                18, 18, 19, 19, 20, 20, 22, 22, 23, 24,
                18, 18, 19, 19, 20, 20, 22, 22, 23, 24,
                18, 18, 19, 19, 20, 20, 22, 22, 23, 24,
                20, 19, 19, 19, 20, 20, 22, 22, 23, 25,
                40, 43, 42, 43, 43, 41, 40, 40, 41, 45]

trinket = ['古代护符', '枯竭的治疗石', '枯竭的法力宝石', '生命徽章', '雄狮号角',  # 普通
           '勇气护符', '力量护符', '英雄徽记', '休眠水晶', '星辰碎片',  # 稀有
           '短暂能量护符', '暗影之眼', '纯焰精华', '烈焰碎片', '恢复宝石',  # 精良
           '黑龙之书', '思维加速宝石','变形符文','毒性图腾','自然之盟水晶', # 精良
           '虫群卫士徽章', '盲目光芒卷轴', '庇护者', '龙血护符', '亡者之眼',  # 史诗
           '古拉巴什狂暴徽记', '燃魂之颅', '暴君之冠', '原始晋升印章', '迅捷坠饰', # 史诗
           '血斧宝钻', '坚定力量之戒', '源力之环', '永恒烈焰之戒', '灵魂热情之戒', # 史诗
           '萨菲隆的精华', '甲虫胸针','赞达拉英雄勋章','堕落神明之戒','无畏之戒', # 史诗
           '宽恕的热情', '奈萨里奥之泪', '克苏恩的触须', '屠龙者的纹章', '尤格-萨隆之爪'  # 传说
           ]

trinket_value = [1, 1, 1, 2, 2,
                 4, 4, 5, 6, 6,
                 7, 7, 7, 8, 9,
                 7, 7, 7, 8, 9,
                 12, 13, 12, 14, 15,
                 12, 13, 12, 14, 15,
                 12, 13, 12, 14, 15,
                 12, 13, 12, 14, 15,
                 21, 22, 25, 26, 28]


trinket_level = [1, 1, 1, 1, 1,
                 2, 2, 2, 2, 2,
                 3, 3, 3, 3, 3,
                 3, 3, 3, 3, 3,
                 4, 4, 4, 4, 4,
                 4, 4, 4, 4, 4,
                 4, 4, 4, 4, 4,
                 4, 4, 4, 4, 4,
                 5, 5, 5, 5, 5 ]